Table of Contents
 Class PretensionedTendonGroup
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
The Pretensioned tendon group
[OpenModelClass("CI.StructModel.Structure.PretensionedTendonGroup,CI.StructuralElements", "CI.StructModel.Structure.IPretensionedTendonGroup,CI.BasicTypes", typeof(Tendon))]
public class PretensionedTendonGroup : Tendon
Inheritance
object
OpenObject
OpenElementId
Tendon
PretensionedTendonGroup
Inherited Members
 Tendon.Material
 Tendon.NumberOfStrand
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PretensionedTendonGroup()
Constructor
public PretensionedTendonGroup()
Properties
 Items
List of the pretensioned tendon in the group
public List<PretensionedTendonGroupItem> Items { get; set; }
Property Value
List<PretensionedTendonGroupItem>
 Edit this page